/// 課題8: 関数　
/// 以下の仕様を満たす関数を作成してください。
void main() {
  /// Q1-2: Q1-1で作成した関数を呼び出してください。

  /// Q2-2: Q2-1で作成した関数を呼び出してください。

  /// Q3-2: Q3-1で作成した関数を呼び出してください。

  /// Q4-2: Q4-1で作成した関数を呼び出してください。

  /// Q5-2: Q5-1で作成した関数を呼び出してください。

  /// Q6-2: Q6-1で作成した関数を呼び出してください。
}

/// Q1-1: `visonary`という文字列を出力する関数を作成してください。
/// 　　　　関数名は`printVisonary`としてください。
void printVisonary() {
  // ここに処理を書いてください。
}

/// Q2-1: String型の引数を1つ持ち、その引数を出力する関数を作成してください。
/// 　　　　関数名は`printString`としてください。
///       引数は、位置引数で受け取ってください。

/// Q3-1: Q2の関数を、名前付き引数で受け取るように書き換えてください。
///       関数名は`printString2`としてください。

/// Q4-1: Q2の関数を、デフォルト引数を持つように書き換えてください。
///      関数名は`printString3`としてください。

/// Q5-1: Q4の関数を、位置引数で受け取るように書き換えてください。
///     関数名は`printString4`としてください。

/// Q6-1: int型の引数を受け取り、以下の条件に従って文字列を返却する関数を作成してください。
/// 　　　　関数名は`printInt`としてください。
/// 　　　　引数が0の場合は、`引数は0です`と出力してください。
/// 　　　　引数が0より大きい場合は、`引数は0より大きいです`と出力してください。
/// 　　　　引数が0より小さい場合は、`引数は0より小さいです`と出力してください。
