/// Dartの基本の型
void main() {
  /// Q1: 20という数字を格納した変数定義をしてください。

  /// Q2: 12.56という数字を格納した定数定義をしてください。

  /// Q3: "satoshi"という文字列を格納した変数定義をしてください。

  /// Q4: trueという真偽値を格納した定数定義をしてください。

  /// Q5: List型の変数listを定義し、[1, 2, 3, 4, 5]という要素を格納してください。

  /// Q6: listの3番目の要素を出力してください。

  /// Q7: Map型の変数mapを定義し、キーと値のペア {"name": "John", "age": 25} を格納してください。

  /// Q8: mapのキー"age"に対応する値を出力してください。

  /// Q9: listに新たな要素6を追加してください。

  /// Q10: mapに新たなキーと値のペア "country": "USA" を追加してください。

  /// Q11: listの要素数を出力してください。

  /// Q12: mapのキーの一覧を出力してください。
}
