/// Dartの計算
void main() {
  final testNum = 3.234562;

  /// Q1: 10という数字を格納した変数定義をしてください。

  /// Q2: 5という数字を格納した変数定義をしてください。

  /// Q3: 変数number1とnumber2の足し算の結果をresultに格納し、出力してください。

  /// Q4: 変数number1とnumber2の引き算の結果をresultに格納し、出力してください。

  /// Q5: 変数number1とnumber2の掛け算の結果をresultに格納し、出力してください。

  /// Q6: 変数number1を変数number2で割った結果をresultに格納し、出力してください。

  /// Q7: resultの値を小数点第2位で四捨五入し、出力してください。

  /// Q8: testNumを小数点第2位で四捨五入し、出力してください。

  /// Q9: testNumを小数点第2位で切り捨てし、出力してください。

  /// Q10: testNumを小数点第2位で切り上げし、出力してください。
}
